INSERT INTO statements (full_name, group_name, phone_number, statement, status, telegram_id, year_entry) VALUES
                                                                                                             ('Барабах Павло Романович', 'КН43с', '+380987654321', 'Довідка з місця навчання', false, 1234567890, '2021'),
                                                                                                             ('Кмита Сергій Володимирович', 'КН43с', '+380987654321', 'Довідка з місця навчання', false, 1234567890, '2021'),
                                                                                                             ('Петренко Іван Васильович', 'КН43с', '+380987654322', 'Довідка для військкомату', false, 1234567891, '2021'),
                                                                                                             ('Шевченко Олександр Михайлович', 'КН43с', '+380987654323', 'Довідка з місця навчання', false, 1234567892, '2021'),
                                                                                                             ('Сидоренко Ольга Петрівна', 'КН43с', '+380987654324', 'Довідка з місця навчання', false, 1234567893, '2021'),
                                                                                                             ('Гнатюк Марія Олексіївна', 'КН43с', '+380987654325', 'Довідка з місця навчання', false, 1234567894, '2021'),
                                                                                                             ('Коваленко Андрій Іванович', 'КН43с', '+380987654326', 'Довідка з місця навчання', false, 1234567895, '2021'),
                                                                                                             ('Бойко Тетяна Сергіївна', 'КН43с', '+380987654327', 'Довідка з місця навчання', false, 1234567896, '2021'),
                                                                                                             ('Мельник Василь Петрович', 'КН43с', '+380987654328', 'Довідка з місця навчання', false, 1234567897, '2021'),
                                                                                                             ('Зубко Анна Андріївна', 'КН43с', '+380987654329', 'Довідка з місця навчання', false, 1234567898, '2021'),
                                                                                                             ('Литвиненко Дмитро Олександрович', 'КН43с', '+380987654330', 'Довідка з місця навчання', false, 1234567899, '2021'),
                                                                                                             ('Павленко Ірина Василівна', 'КН43с', '+380987654331', 'Довідка з місця навчання', false, 1234567800, '2021'),
                                                                                                             ('Романенко Юлія Іванівна', 'КН43с', '+380987654332', 'Довідка з місця навчання', false, 1234567801, '2021');

INSERT INTO users (user_name, encrypted_password, enabled)
VALUES ('user', '$2a$10$BXH1wlAJPIMXvjnJTBoRuea4CvZwSs8/Zqz4bDRZBDJ6hxvXoHlqq', TRUE),
       ('admin', '$2a$10$BXH1wlAJPIMXvjnJTBoRuea4CvZwSs8/Zqz4bDRZBDJ6hxvXoHlqq', TRUE);
INSERT INTO roles (role_name, user_id)
VALUES ('USER', 1),
       ('ADMIN', 2);