INSERT INTO statements (full_name, group_name, phone_number, institute, type_of_statement, telegram_id, year_entry) VALUES
                                                                                                                        ('Барабах Павло Романович', 'КН43с', '+380987654321', 'Інститут комп’ютерних наук', 'Довідка з місця навчання', 1234567890, '2021'),
                                                                                                                        ('Кмита Сергій Володимирович', 'КН43с', '+380987654321', 'Інститут комп’ютерних наук', 'Довідка з місця навчання', 1234567890, '2021'),
                                                                                                                        ('Петренко Іван Васильович', 'КН43с', '+380987654322', 'Інститут комп’ютерних наук', 'Довідка для військкомату', 1234567891, '2021'),
                                                                                                                        ('Шевченко Олександр Михайлович', 'КН43с', '+380987654323', 'Інститут комп’ютерних наук', 'Довідка з місця навчання', 1234567892, '2021'),
                                                                                                                        ('Сидоренко Ольга Петрівна', 'КН43с', '+380987654324', 'Інститут комп’ютерних наук', 'Довідка з місця навчання', 1234567893, '2021'),
                                                                                                                        ('Гнатюк Марія Олексіївна', 'КН43с', '+380987654325', 'Інститут комп’ютерних наук', 'Довідка з місця навчання', 1234567894, '2021'),
                                                                                                                        ('Коваленко Андрій Іванович', 'КН43с', '+380987654326', 'Інститут комп’ютерних наук', 'Довідка з місця навчання', 1234567895, '2021'),
                                                                                                                        ('Бойко Тетяна Сергіївна', 'КН43с', '+380987654327', 'Інститут комп’ютерних наук', 'Довідка з місця навчання', 1234567896, '2021'),
                                                                                                                        ('Мельник Василь Петрович', 'КН43с', '+380987654328', 'Інститут комп’ютерних наук', 'Довідка з місця навчання', 1234567897, '2021'),
                                                                                                                        ('Зубко Анна Андріївна', 'КН43с', '+380987654329', 'Інститут комп’ютерних наук', 'Довідка з місця навчання', 1234567898, '2021'),
                                                                                                                        ('Литвиненко Дмитро Олександрович', 'КН43с', '+380987654330', 'Інститут комп’ютерних наук', 'Довідка з місця навчання', 1234567899, '2021'),
                                                                                                                        ('Павленко Ірина Василівна', 'КН43с', '+380987654331', 'Інститут комп’ютерних наук', 'Довідка з місця навчання', 1234567800, '2021'),
                                                                                                                        ('Романенко Юлія Іванівна', 'КН43с', '+380987654332', 'Інститут комп’ютерних наук', 'Довідка з місця навчання', 1234567801, '2021');

INSERT INTO statements_info (id, is_ready, status) VALUES
                                                                 (1, FALSE, FALSE),
                                                                 (2, FALSE, FALSE),
                                                                 (3, FALSE, FALSE),
                                                                 (4, FALSE, FALSE),
                                                                 (5, FALSE, FALSE),
                                                                 (6, FALSE, FALSE),
                                                                 (7, FALSE, FALSE),
                                                                 (8, FALSE, FALSE),
                                                                 (9, FALSE, FALSE),
                                                                 (10, FALSE, FALSE),
                                                                 (11, FALSE, FALSE),
                                                                 (12, FALSE, FALSE),
                                                                 (13, FALSE, FALSE),
                                                                 (14, FALSE, FALSE);

INSERT INTO users (user_name, encrypted_password)
VALUES ('user', '$2a$10$BXH1wlAJPIMXvjnJTBoRuea4CvZwSs8/Zqz4bDRZBDJ6hxvXoHlqq'),
       ('admin', '$2a$10$BXH1wlAJPIMXvjnJTBoRuea4CvZwSs8/Zqz4bDRZBDJ6hxvXoHlqq');

INSERT INTO roles (name) VALUES
                             ('USER'),
                             ('ADMIN');

iNSERT INTO user_roles (user_id, role_id) VALUES
                                            (1, 1),
                                            (2, 2);

